<?php

namespace App\Http\Controllers\Api\User;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;

class PageController extends Controller
{
    public function index(Request $request)
    {
        $content = '';

        if ($request->name === 'rules') {
            $content = '
		<p class="uk-text-justify">مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری اشخاص حقیقی و یا حقوقی در اپلیکیشن یا سایر خدمات ارائه شده در اپ آنیروب انجام می‌شود، به عهدۀ کاربران است. بنابراین مسئولیت اشخاص ثالث یا افرادی غیر از کاربر که با آن حساب از خدمات اپلیکیشن استفاده می‌کنند، تماما متوجه کاربر صاحب‌حساب است. کاربر دارای حساب کاربری، دارای مسئولیت تضامنی در قبال اشخاص اعم از شرکت و سایر کاربران هستند.<br>
			<br>
			مسئولیت حفظ امنیت اطلاعات حساب کاربری شامل نام کاربری و رمز عبور به عهدۀ کاربر است. در صورت مفقود شدن یا به سرقت رفتن اطلاعات حساب کاربری و گوشی موبایل، کاربر مذکور موظف است در اسرع وقت موضوع را به اطلاع شرکت برساند. بدیهی است تا زمانی که اطلاع‌رسانی به شرکت انجام نشده است، مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری مذکور و موبایل کاربر انجام شده و می‌شود به عهدۀ وی خواهد بود.<br>
			<br>
			کاربران حق ندارند به سایر اشخاص حقیقی و حقوقی اجازه استفاده از حساب کاربری خود را بدهند یا حساب خود را به شخص حقیقی یا حقوقی دیگری منتقل کنند. در مورد کاربر شخص حقوقی نیز، مسئولیت‌های قانونی بهره‌برداری از خدمات آنیروب متوجه مدیران اشخاص حقوقی خواهد بود.<br>
			<br>
			با استفاده از خدمات اپ آنیروب، کاربران می‌پذیرند و موظف هستند که از خدمات ارائه شده برای انجام هیچ فعالیت غیر‌قانونی طبق قوانین جمهوری اسلامی ایران، خلاف شرع و اموال نامشروع استفاده نکنند.<br>
			<br>
			کاربران متعهد می‌شوند هیچ‌گاه از خدمات آنیروب به صورتی که به آنیروب، طرف تجاری و شرکای آن صدمه‌ای وارد کند استفاده نکنند. در صورتی که کاربران نسبت به سوءاستفاده از امکانات فراهم شده در خدمات آنیروب در جهت منافع شخصی و یا آسیب مادی یا معنوی به منافع شرکت اقدام کنند، شرکت ضمن داشتن حق قطع خدمات و غیرفعال کردن حساب کاربری آنها، مجاز خواهد بود، با مراجعه به مراجع ذیصلاح، نسبت به پیگیری قانونی از جمله مطالبه خسارات وارده اقدام کند.<br>
			<br>
			کاربران به دو روش نقدی و افزایش اعتبار کیف پول می‌توانند مبلغ ریالی پسماند تحویلی خود را دریافت کنند.<br>
			در صورتی که افزایش اعتبار کیف پول را انتخاب نمایند می‌توانند از فروشگاه، مزایا و تخفیف‌های اپلیکیشن استفاده کنند.<br>
			کاربران می‌پذیرند اعتباری که در حساب کاربری خود دارند مستقل از روش کسب قانونی آن (اگر در نتیجه افزایش اعتبار از طریق درگاه بانک یا وارد کردن کدهای تخفیفی که شرکت در اختیار آنها قرار داده یا هر روش دیگری باشد) فقط برای استفاده از خدمات و فروشگاه آنیروب قابل استفاده است و امکان دریافت این وجه را به صورت نقد ندارند.<br>
			<br>
			<br>
			پاکبانان حق ندارند اشیاء غیرمجاز از جمله مشروبات الکلی، مواد مخدر، سلاح اموال سرقتی و نامشروع یا سایر اشیاء و ادواتی که طبق قانون جمهوری اسلامی ایران مجاز نیست، در وسیله نقلیه همراه داشته باشند.<br>
			<br>
			پاکبانان موظف هستند از سرقتی نبودن ضایعات خشک و پسماندهای دریافتی اطمینان حاصل نمایند و در صورت مشکوک بودن فوراً با شرکت در میان بگذارند. در غیر این صورت مسئولیت آن با آن پاکبان خواهد بود.<br>
			<br>
		هرگونه استفاده از اپ آنیروب به معنی پذیرفتن شرایط مندرج در این اپ است. آنیروب هیچ توافقی با کاربران خارج از این شرایط ندارد.</p>
	';
        } else if ($request->name === 'privacy') {
            $content = '
	<p class="uk-text-justify">۱) چه اطلاعاتی جمع‌آوری می‌شود:<br>
	در زمان ثبت‌نام، شماره تماس، اسم و فامیل از كاربر گرفته می‌شود و در انجام پروسه كاری، موقعیت مكانی كه كاربر برای ارسال ماشین مشخص می‌كند، گردآوری می‌شود.<br>
	در صورت بروز خطا، مشخصات سیستم‌عامل و مرورگر شما برای مطالعه بروز خطا و عیب‌یابی، جمع‌آوری می‌شود.<br>
	<br>
	۲) چگونه از اطلاعات استفاده می‌شود:<br>
	از اطلاعات دریافتی، در جهت ارایه بهتر خدمات به كاربر و كیف پول الكترونیكی (PSP) برای تسویه مبالغ با كاربر انجام می‌شود.<br>
	<br>
	۳) امنیت اطلاعات شخصی:<br>
	الف) در تمام قسمت‌های برنامه، از پروتکل HTTPS استفاده می‌شود.<br>
	ب) برای هر بار ورود به حساب کاربری از رمز عبور یک‌بار مصرف (OTP) استفاده می‌شود که تنها با دسترسی به شماره تلفن همراهی که از طریق آن، حساب کاربری خود را ایجاد کرده‌اید، امکان‌پذیر است.<br>
	<br>
	۴) استفاده از کوکی‌ها (Cookie) و "Tracker":<br>
	ممکن است از کوکی‌ها در جمع‌آوری اطلاعات استفاده کنیم. کوکی فایلی است که به درخواست یک سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان ذخیره بازدید‌های شما و مناسب‌سازی آنها را فراهم می‌نماید.<br>
	<br>
	۵) چگونه یک کاربر می‌تواند از جمع‌آوری یا استفاده از داده انصراف دهد:<br>
	كاربر می‌تواند با تماس با پشتیبانی و پس از احراز هویت، انصراف خود را انجام دهد.<br>
	<br>
	۶) اطلاعات تماس شرکت:<br>
	مشهد – قاسم‌آباد - حجاب ۸۵/۲ - بلوک ۹ <br>
	ایمیل: aniroob@gmail.com</p>
';
        }
        return sendJson('success','',['content' => $content]);
    }
}
